#მეგობრებო, ქვემოთ კომენტარის სახედ მოცემულია დავალების პირობები. ყოველი ამოცანის ქვეშ დაწერეთ თქვენი პასუხი. პითონ ფაილის ჩამოტვირთვისას დააწერეთ davaleba 7 - elena bliadze.py 
# ოღონდ elena bliadze -ს ნაცვლად თქვენი სახელი და გვარი. გისურვებთ წარმატებას ! ასევე გაითვალისწინეთ მოცემული დავალება ფოლდერით უნდა ატვირთოთ გითჰაბზე და ლინკი კომენტარში დაურთოთ თქვენს მიერ ატვირთულ დავალებას.
#გისურვებთ წარმატებას!

# დაწერე (ჩაფასთე მარჯვნივ(გასწვრივ)) გითჰაბის ლინკი, სადაც ატვირთე შენი ფაილი:  


#1. მომხმარებლის რეგისტრაცია: შექმენი პროგრამა, რომელიც გაატარებს მოხმარებელს რეგისტრაციას დაგჭირდება ფუნქცია:
#register_user (username:str,password:str) , 1 - პარამეტრის სიგრძე მინიმუმ 3, 2 - პარამეტრის მინიმუ 5  წარმატებული რეგისტრაციის გავლის შემთხვევაში დააბრუნოს 
#შესაბამისი მესიჯი. (შენიშვნა: ფუნქციის გამოძახებისას შენ ჩააწოდე ორივე პარამეტრის მნიშვნელობა და არ გამოიყენო input())

# def register_user(username,pasword):
#     if len(username)>3 and len(pasword)> 5  :
#         print ('kargia')
#     else:
#         print('ver daregistrirdi')
# register_user(f'lazare','fffvvv')


#2. კალკულალტორი: შექმენი პროგრამა, რომელიც იქნება მინი კალკულატორი , შემდეგი ოპერატორებისთვის +,-,*,/ :
#ფუნქციის დასახელება calculate(a,b,oper). ფუნქციას, როდესაც შესამოწმებელ რიცხვებს ჩააწოდებთ, ასევე შესაბამისი მესიჯი გამოჰქონდეს.

# def calculate(a,b,oper):
#     if oper == '*':
#         print('namravlia ' , a*b)
#     if oper == '+':
#         print('jamia' , a+b)
#     if oper == '-':
#         print('sxvaobaa ' , a-b)
#     if oper == '/':
#         print('ganayopia ' , a/b)

# calculate(2,4,'+')



#3.გრადუსის კონვერტაცია: შექმენი ფუნქცია, რომელიც გადაგვიყვანს ჩაწოდებულ რიცხვს ფარენჰეითში ცელსიუსის შემთხვევაში და ფარენჰეითის ცელსიუსში :
#ფორმულები : (ცელსიუსი* 9/5) +32, (ფარენჰეითი-32)* (5/9) 

# def cel_par(a):
#     print((a* 9/5) +32)
# def par_cel(b):
#     print((b-32)* (5/9) )

# cel_par(6)
# par_cel(9)
#იმედია პირობა სწორად გავიგე:)




#4. ფაილის წაკითხვა: შექმენი ფუნქცია, რომელიც წაიკითხავს შენს ფაილს და წაიკითხავს შიგთავსს.
#შენიშვნა ფაილიც სავალდებულოა მოყვეს დავალება, ანუ აგდებთ მოცემულ და txt ფაილებს ფოლდერში.
# def fun():
#     f = open('file.txt', 'r') 
#     content=f.read() 
#     f.close()
# fun()



#5. შეაჯამე ფუნქცის არგსის გამოყენებით , შემდეგი მნიშვნელობები : (100.50, 200.75, 50.25)


# def efd(*args):
#     return efd(args)

# result = efd(100.50, 200.75, 50.25)
# print(result)





#6. დაითვალე , მოცემული სიტყვების სიგრძე: ("Workout", "Grocery shopping", "Read", "Cook dinner")

# a = ("Workout", "Grocery shopping", "Read", "Cook dinner")
# b = len(a[0])
# c= len(a[1])
# d = len(a[2])
# e = len(a[3])
# print(b,c,d,e)

#7. მოიფიქრე ფუნქცია სადაც გამოიყენებ **kwargs

# def my_func(**kwargs):
#     print(kwargs)
# my_func(a=1, b=2, c=3)
# my_func(name="Alice", age=25)

#8. გამოითვალე რიცხვების საშუალო მოცემული რიცხვებისთვის: [10, 20, 30, 40]

# a = [10, 20, 30, 40]
# b = sum(a) / len(a)
# print(b)


#9.შექმენი ფუნქცია რომელიც ამოიღებს დუბლიკატებს (მსგავსებს): [1, 2, 2, 3, 4, 4, 5]


# ede = []

# a = [1, 2, 2, 3, 4, 4, 5]
# for i in a :
#     if i not in ede:
#         ede.append(i)

# print(ede)

#10. შექმენი შენი საკუთარი მოდული და ნაცნობი მოდულების გამოყენებით, შექმენი შენთვის სასურველი პრპოგრამა.

from math import *
def mathem(a,b): 
    result = a + b
    main_result = sqrt(result)
    return main_result
a=4
b=5
print("Result of sqrt:", mathem(a,b))



