 
#მეგობრებო, ქვემოთ კომენტარის სახედ მოცემულია დავალების პირობები. ყოველი ამოცანის ქვეშ დაწერეთ თქვენი პასუხი. პითონ ფაილის ჩამოტვირთვისას დააწერეთ davaleba 4 - elena bliadze.py 
# ოღონდ elena bliadze -ს ნაცვლად თქვენი სახელი და გვარი. გისურვებთ წარმატებას ! ასევე გაითვალისწინეთ მოცემული დავალება ფოლდერით უნდა ატვირთოთ გითჰაბზე და ლინკი კომენტარში დაურთოთ თქვენს მიერ ატვირთულ დავალებას.
#გისურვებთ წარმატებას!

# დაწერე (ჩაფასთე მარჯვნივ(გასწვრივ)) გითჰაბის ლინკი, სადაც ატვირთე შენი ფაილი:  

#Tuples : 

#1. დაწერე პროგრამა , რომელიც დაითვლის მოცემული tupex = ((), (), ('',), 'a', 'b', ('a', 'b', 'c'), ('d'),1,2,3,4) სიგრძეს.

# tupex = ((), (), ('',), 'a', 'b', ('a', 'b', 'c'), ('d'),1,2,3,4) 
# print(len(tupex))

#2. დაწერე პროგრამა, რომელიც დაასორტირებს ტაპლში არსებულ ელემენტებს ინტეჯერების მიხედვით data = [('item1', '12'), ('item2', '15'), ('item3', '24')]

# data = [('item1', '12'), ('item2', '15'), ('item3', '24')]
# r = data.sort
# print(r)

#3. შექმენი სასურველი თაფლი, რომელშიც ჩაყრი სიტყვიერ მონაცემებს და შემდეგ დაალაგებ ანბანურად და ანბანურად დალაგების შემდგომმა უკუღმა.

# data = ('ed','rf','assd','ssxxc')
# axalilisti = list(data)
# axalilisti.sort()
# print(axalilisti)
# axalilisti.reverse()
# print(axalilisti)




#4. გაახუთმაქ თაფლში არსებული ელემენტები, ელემენტები შენით მოიფიქრე.

# d = (5,6,7,8,9)
# new = list(d)
# new = []
# for i in new :
#    i *=5
# i.append(new)
# print(new)

#Set - ები:
#5. შექმენით სიმრავლე შემდეგი ელემენტებით : 0, 1, 2, 3, 4. დაამატეთ ნებისმიერ 3 ელემენტი სურვილისამებრ. 
# წაშალეთ ორი ელემენტი სიმრავლიდან. დაბეჭდეთ სიმრავლის ელემენტები ცალ ცალკე ხაზზე (გამოიყენეთ for ციკლი). 
# დაითვალეთ სიმრავლის ელემენტების რაოდენობა.

data = (0,1,2,3,4)
data.append(1)







#6. შექმენით ორი სიმრავლე: set1 სიმრავლე ელემენტებით "green”, "blue”; set2 სიმრავლე ელემენტებით
# "blue", "yellow”. იპოვეთ ამ ორი სიმრავლის გაერთიანება, თანაკვეთა, სხვაობა და სიმეტრიული
# სხვაობა (შეასრულეთ დავალება ორი გზით: არსებული მეთოდით (ფუნქციით) და შესაბამისი
# ოპერატორით.)

#7. დაწერეთ პროგრამა რომელიც იპოვის სიმრავლეში მაქსიმალურ და მინიმალურ მნიშვნელობას და დაბეჭდეთ შედეგი (სიმრავლე შეარჩიეთ სურვილისამებრ).

#8. შექმენით 2 სეტი, დაარქვით სასურველი სახელები და შეასრულეთ ნასწავლი მასალიდან 5 მეთოდის მაგალითი.

#9.მომხარებელს შეაყვანინეთ 2 სიტყვა. დაბეჭდეთ ამ ორი სიტყვის ყველა საერთო ასო