
 #მეგობრებო, ქვემოთ კომენტარის სახედ მოცემულია დავალების პირობები. ყოველი ამოცანის ქვეშ დაწერეთ თქვენი პასუხი. პითონ ფაილის ჩამოტვირთვისას დააწერეთ davaleba 2 - elena bliadze.py 
# ოღონდ elena bliadze -ს ნაცვლად თქვენი სახელი და გვარი. გისურვებთ წარმატებას ! ასევე გაითვალისწინეთ მოცემული დავალება ფოლდერით უნდა ატვირთოთ გითჰაბზე და ლინკი კომენტარში დაურთოთ თქვენს მიერ ატვირთულ დავალებას.
#გისურვებთ წარმატებას!

# დაწერე (ჩაფასთე მარჯვნივ(გასწვრივ)) გითჰაბის ლინკი, სადაც ატვირთე შენი ფაილი:  


#1. დაბეჭდეთ 8-ის ჯერადი რიცხვები 200-დან 25-ის ჩათვლით კლებადობით. 

# for i in range (200 , 1, -8):
#     print (i) 

#2. დაითვალეთ 100-დან 2500-ის ჩათვლით რიცხვების ჯამი რომლებიც არიან 7-ის და 5-ის ჯერადი
#   ერთდროულად. დაბეჭდეთ მიღებული შედეგი.

# aa = 0
# for i in range (100,2500,):
#     if i % 35 == 0:
#         aa +=i
# print(aa)     
#    
#3. დაითვალეთ 1500-დან 2100-ის ჩათვლით 5-ის ჯერადი რიცხვების რაოდენობა. დაბეჭდეთ შედეგი.

# aa = 0 
# for i in range  (1500,2100):
#     if i % 5 == 0:
#         aa += 1 
# print(aa)       

#4. დაბეჭდეთ ეკრანზე 15-დან 150-მდე 5-ის ჯერადი რიცხვები გარდა 50-ის, 75, 80-ისა. გამოიყენეთ continue
#ოპერატორი.

# for i in range(15, 150):
#     if i % 5 == 0:
#         if i == 50 or i == 75 or i == 80:
#             continue  
#         print(i)
#5. შეიყვანეთ ნებისმიერი 2 რიცხვი. ციკლის გამოყენებით დაბეჭდეთ შეყვანილი რიცხვების საერთო გამყოფები. მაგ. 15-ის და 18-ის საერთო გამყოფებია: 1, 3

# a = int(input("sheiyvane ricxvi"))
# b = int(input("sheiyvane ricxvi"))
# for i in range (1,a + 1):
#     if a % i ==0 and b % i == 0:
#         print(i)
        
#6. შეიყვანეთ 2 დადებითი მთელი რიცხვი. იპოვეთ ამ ორი რიცხვის უმცირესი საერთო ჯერადი.


# a = int(input("sheiyvane ricxvi"))
# b = int(input("sheiyvane ricxvi"))
# if a or b % a or b == 0:
#     if a > b :
#         for i in range (b,a+1):
#             if i % a ==0 and i % b ==0:
#                 print(i)
#     if b > a :
#         for x in range (a,b+1):    
#             if x % b == 0 and x % a == 0:
#                 print(x)
# if a or b % a or b != 0:
#     print(a*b)





#პირობითები:
#7. დაწერეთ პროგრამა, რომლის მეშვეობითაც შეიტანთ ნებისმიერ რიცხვს. პროგრამამ შეამოწმოს, თუ შეყვანილი რიცხვი 10-ის ჯერადია, დაბეჭდოს “რიცხვი ბოლოვდება 0-ით”, 
# თუ არადა დაბეჭდოს “რიცხვი არ ბოლოვდება 0-ით”. 
# (გაითვალისწინეთ: 10-ის ჯერადი ნიშნავს რომ 10-ზე გაყოფისას ნაშთი არის 0).

# a = int(input("shemoiyvane ricxvi"))
# if a % 10 == 0:
#     print("ricxvi bolovdeba nulit")
# else:
#     print("ricxvi ar bolovdeba nulit")    



#8. დაწერეთ პროგრამა, რომლის მეშვეობითაც შეიტანთ ნებისმიერ რიცხვს. პროგრამამ შეამოწმოს, თუ რიცხვი დადებითია, დაბეჭდოს ეკრანზე “Number is positive”, თუ რიცხვი უარყოფითია, 
# დაბეჭდოს “Number is negative”, თუ არადა დაბეჭდოს “Number is equal to zero”.

# a = int(input("shemoiyvane ricxvi"))
# if a > 0 :
#     print("number is positive")
# if a < 0 :
#     print("number is negative")    
# if a == 0:
#     print("numbers is  equal to zero")

#9.დაწერეთ პროგრამა, რომლის მეშვეობითაც შეიტანთ ორ ნებისმიერ რიცხვს. პროგრამამ შეამოწმოს, თუ ორივე შეყვანილი რიცხვი 10-ზე მეტია, დაითვალეთ მათი საშუალო არითმეტიკული, 
# თუ არადა დაითვალეთ მათი ნამრავლი. დაბეჭდეთ მიღებული შედეგი.

# a = int(input("shemoiyvane ricxvi"))
# b = int(input("shemoiyvane ricxvi"))
# if a > 10 and b > 10:
#     print(a * b )
# if a <= 10 and b <= 10:
#     print((a+b)/2)




#10. დაბეჭდე კალკულატორი ციკლის და პირობითი ოპერატოორების გამოყენებით, გამოიყენე ოპერაციებად + - მიმატება, ** - ხარისხში აყავანა, /- გაყოფა.

a = int(input("shemoiyvane ricxvi"))
b = int(input("shemoiyvane ricxvi"))

choice = input("romeli moqmedeba ginda   +,**,/")
if choice == "+":
    print(a+b)
























