
#მეგობრებო, ქვემოთ კომენტარის სახედ მოცემულია დავალების პირობები. ყოველი ამოცანის ქვეშ დაწერეთ თქვენი პასუხი. პითონ ფაილის ჩამოტვირთვისას დააწერეთ davaleba 6 - elena bliadze.py 
# ოღონდ elena bliadze -ს ნაცვლად თქვენი სახელი და გვარი. გისურვებთ წარმატებას ! ასევე გაითვალისწინეთ მოცემული დავალება ფოლდერით უნდა ატვირთოთ გითჰაბზე და ლინკი კომენტარში დაურთოთ თქვენს მიერ ატვირთულ დავალებას.
#გისურვებთ წარმატებას!

# დაწერე (ჩაფასთე მარჯვნივ(გასწვრივ)) გითჰაბის ლინკი, სადაც ატვირთე შენი ფაილი:  

# იქამდე სანამ დავალების შესრულებას დაიწყებდე შექმენი ფოლდერი და იქ განათავსე მმოცემული პითონის ფაილი და თქსთ ფაილი, რომელთანაც იმუშავებ.

#სტრიქონები & ფაილებთან მუშაობა & try&except ბლოკი

#მოცემულია :
leqsi = """ მირბის, მიმაფრენს უგზო-უკვლოდ ჩემი მერანი,
            უკან მომჩხავის თვალბედითი შავი ყორანი!
            გასწი, მერანო, შენს ჭენებას არ აქვს სამძღვარი,
            და ნიავს მიეც ფიქრი ჩემი, შავად მღელვარი!"""


#1. დაწერეთ პროგრამა, რომელიც  დაყოფს მოცემული სტროფის 2 ტაეპს  ლისტის ობიექტებად, დაითვლის განახლებული ლისტის სიგრძეს და არსბეულ 1 და 2 ადგილზე მდგომ ობიექტებს დააკონკატენირებს.
# მოცემული სტროფი
leqsi = """ მირბის, მიმაფრენს უგზო-უკვლოდ ჩემი მერანი,
            უკან მომჩხავის თვალბედითი შავი ყორანი!
            გასწი, მერანო, შენს ჭენებას არ აქვს სამძღვარი,
            და ნიავს მიეც ფიქრი ჩემი, შავად მღელვარი!"""

# lines = leqsi.strip().split('\n')


# line1 = lines[0].strip()
# line2 = lines[1].strip()


# leqsi_list = [line1, line2]


# list_length = len(poem_list)

# concatenated = line1 + " " + line2

# print("ლისტის სიგრძე: {list_length}")
# print("1 და 2 სტროფების კონკატენაცია: {concatenated}")


#2.დაწერეთ პროგრამა, რომლის მეშვეობით გახსნით უკვე არსებულ ფაილს და ბოლოში დაამატეთ თქვენთვის სასურველი ტექსტი. 

# f = open('datafile.txt', 'w')
# f.write("added text")  
# f.close() 




#3. დაწერეთ პროგრამა რომელიც წაიკითხავს ტექსტს ფაილიდან და დაბეჭდავს ეკრანზე მაღალ რეგისტრში. (ამ შემთხვევაში შექმენი , შენი ფაილია და ჩაწერილი დახვდეს ინგლისური ასოებით ტექსტი)

# f = open('datafile.txt', 'r') 
# content=f.read() 
# print(content) 
# f.close() 


#4. შექმენით ტექსტური ფაილი,რომელშიც ჩაწერთ რიცხვებს ცალ-ცალკე ხაზზე. დაწერეთ პროგრამა, რომელიც წაიკითხავს მონაცემებს ფაილიდან, აიყვანს რიცხვებს კვადრატში და ჩაწერს შედეგებს ახალ ფაილში.
# file = open ('datafile.int','w')
# for i in file :
#     i**2
# print(file)
#5. მოიფიქრე და დაწერე ,მხოლოდ try-except ით ბლოკი, ფაილებთან სამუშაოდ. გაითვალისწინე გამონაკლისად, მინიმუმ 2 შეცდომა მაინც უნდა გქონდეს , შესაბამის მესიჯთან ერთად.
    # try:
    #     a = int(input ("Input the first number "))
    #     b = int (input ("Input the second number "))
    #     print ("(a) // {b} = (a // bt")
    # except ValueError:
    #     print ("ValueError occurred.")
    # except ZeroDivisionError:
    #     print ("ZerodivisionError occurred. ")
    # except :
    #     print("Print any Errors: ")
    #
#6. დაწერე კალკულატორი, ციკლის, try-except ბლოკის გამოყენებით და შენმა კალკულატორმა დაითვალოს +, - ან / .
# try:
#     a = int(input ("Input the first number "))
#     b = int (input ("Input the second number "))
#     nishani = input("ra vqna +,- tu /")
# except ZeroDivisionError:
#     print('me magas ver gavyop ')
# except ValueError:
#     print('magas ver davtvli')
# if nishani == "+":
#     print(a+b)
# if nishani == "-":
#     print(a-b)
# if nishani == '/':
#     print(a/b)


#7.  დაუმატე შენს მიერ დაწერილ კალკულატორს raise (ანუ მოიფიქრე შენი ერორი)

# try:
#     a = int(input ("Input the first number "))
#     b = int (input ("Input the second number "))
#     nishani = input("ra vqna +,- tu /")
#     raise ValueError
# except ZeroDivisionError:
#     print('me magas ver gavyop ')
# except ValueError:
#     print('magas ver davtvli')
# if nishani == "+":
#     print(a+b)
# if nishani == "-":
#     print(a-b)
# if nishani == '/':
#     print(a/b)


#8. გამოიყენე f-format მეთოდი, და დაწერე შენთვის სასურველი პროგრამის მგალაითი ნასწავლი მასალიდან.
# saxeli= "givi"
# asaki= 30
# laparaki = f"gamarjoba me var  {saxeli} da me var {asaki} wlis."
# print(laparaki)

#9.გამოიტენე %s, %d, %f პროგრამის მესიჯის დასაბეჭდათ, და დაწერე შენთვის სასურველი მაგალითი ნასწავლი მასალიდან.

# name = "ნიკა"
# age = 25
# height = 1.75

# print("სახელი: %s, ასაკი: %d, სიმაღლე: %.2f" % (name, age, height))

#10. დაწერეთ კოდი, რომელიც გამოითვლის და დაბეჭდავს [100, 450] შუალედიდან აღებული ყველა 3-ის ჯერადი მთელი რიცხვის კუბების ჯამს გამოკლებული 
# იმავე შუალედიდან აღებული 7-ის ჯერადი რიცხვების კვადრატების ჯამი. გამოიტანე შენთვის სასურველი მესიჯი, ნაცნობი ფორმატირების ხერხებით.
# b = 0
# for i in range(100, 450):
#     if i % 3 == 0:
#         b += i ** 3

# c = 0
# for w in range(100, 450):
#     if w % 7 == 0:
#         c += w ** 2

# print(b - c)

